@php
    $currentexam = '';
    $direction = '';
    $sortable = '';
    $exams = [];
@endphp

<main class="main-content" id="dashboard-top">
    <x-topbar.topbar>Créer une épreuve</x-topbar.topbar>
    <div class="main-container">

    <form action="" class="create-form">
        <fieldset class="formfield m-b-32">
            <div class="d-flex flex-row wrap space-between a-i-center">
                <legend class="h2-title bold">
                    Epreuve
                </legend>
                <p class="caption">
                    * Champs obligatoires
                </p>
            </div>

            <div class="fields-container">
                <x-fields.text name="exam-name" id="exam-name" wire="exam-name" placeholder="CV" value="">
                    Nom épreuve*
                </x-fields.text>
                <x-fields.date>
                    Date*
                </x-fields.date>
                <x-fields.text name="exam-time" id="exam-time" wire="exam-time" placeholder="08-12 et 12-17h" value="">
                    Heure*
                </x-fields.text>
            </div>

        </fieldset>

        <fieldset class="formfield m-b-32">
            <div class="d-flex flex-row wrap space-between a-i-center">
                <legend class="h2-title bold">
                    Contacts
                </legend>
                <p class="caption">
                    * Champs obligatoires
                </p>
            </div>

            <div class="d-flex flex-row gap-32 wrap">
                <div class="container-left">
                    <p class="m-b-20">
                        Sélectionnez les contacts qui auront le rôle d’évaluateur lors de l’épreuve
                    </p>
                    <div class="fields-container">
                        <div class="search">
                            <x-fields.show-search>
                                Évaluateurs*
                            </x-fields.show-search>
                   {{--         <div>
                                <label for="exam-name">
                                    Évaluateurs*
                                </label>
                                --}}{{--SEARCH--}}{{--
                            </div>
                            <div>
                                    <!--....-->
                            </div>--}}
                        </div>
                        <div>
                            <p class="medium m-b-16">
                                Evaluateurs séléctionnés
                            </p>
                            <ul class="d-flex flex-c gap-12">
                                <li class="d-flex flex-row space-between a-i-center">
                                    <span>
                                        John Doe
                                    </span>
                                    <span class="trash-btn">
                                        <svg xmlns="http://www.w3.org/2000/svg" width="18" height="18" viewBox="0 0 18 18" fill="none">
  <g clip-path="url(#clip0_176_1509)">
    <path d="M13.5704 17.0002H4.43043C4.23802 16.9957 4.0484 16.9533 3.87239 16.8754C3.69639 16.7976 3.53744 16.6858 3.40464 16.5465C3.27184 16.4072 3.16779 16.2431 3.09844 16.0636C3.02908 15.8841 2.99578 15.6926 3.00043 15.5002V5.61523H4.00043V15.5002C3.99565 15.5613 4.00301 15.6228 4.02206 15.681C4.04112 15.7393 4.0715 15.7932 4.11146 15.8396C4.15142 15.8861 4.20017 15.9242 4.25491 15.9518C4.30965 15.9793 4.3693 15.9958 4.43043 16.0002H13.5704C13.6316 15.9958 13.6912 15.9793 13.7459 15.9518C13.8007 15.9242 13.8494 15.8861 13.8894 15.8396C13.9294 15.7932 13.9597 15.7393 13.9788 15.681C13.9978 15.6228 14.0052 15.5613 14.0004 15.5002V5.61523H15.0004V15.5002C15.0051 15.6926 14.9718 15.8841 14.9024 16.0636C14.8331 16.2431 14.729 16.4072 14.5962 16.5465C14.4634 16.6858 14.3045 16.7976 14.1285 16.8754C13.9525 16.9533 13.7628 16.9957 13.5704 17.0002Z" fill="black"/>
    <path d="M15.39 4.5H2.5C2.36739 4.5 2.24021 4.44732 2.14645 4.35355C2.05268 4.25979 2 4.13261 2 4C2 3.86739 2.05268 3.74021 2.14645 3.64645C2.24021 3.55268 2.36739 3.5 2.5 3.5H15.39C15.5226 3.5 15.6498 3.55268 15.7436 3.64645C15.8373 3.74021 15.89 3.86739 15.89 4C15.89 4.13261 15.8373 4.25979 15.7436 4.35355C15.6498 4.44732 15.5226 4.5 15.39 4.5Z" fill="black"/>
    <path d="M10.5 6.5H11.5V14H10.5V6.5Z" fill="black"/>
    <path d="M6.5 6.5H7.5V14H6.5V6.5Z" fill="black"/>
    <path d="M11.5 2.93H10.55V2H7.45V2.93H6.5V2C6.49968 1.74322 6.59815 1.49616 6.775 1.31C6.95186 1.12384 7.19354 1.01284 7.45 1H10.55C10.8065 1.01284 11.0481 1.12384 11.225 1.31C11.4019 1.49616 11.5003 1.74322 11.5 2V2.93Z" fill="black"/>
  </g>
  <defs>
    <clipPath id="clip0_176_1509">
      <rect width="18" height="18" fill="white"/>
    </clipPath>
  </defs>
</svg>
                                    </span>
                                </li>

                                <li class="d-flex flex-row space-between a-i-center">
                                    <span>
                                        John Doe
                                    </span>
                                    <span class="trash-btn">
                                        <svg xmlns="http://www.w3.org/2000/svg" width="18" height="18" viewBox="0 0 18 18" fill="none">
  <g clip-path="url(#clip0_176_1509)">
    <path d="M13.5704 17.0002H4.43043C4.23802 16.9957 4.0484 16.9533 3.87239 16.8754C3.69639 16.7976 3.53744 16.6858 3.40464 16.5465C3.27184 16.4072 3.16779 16.2431 3.09844 16.0636C3.02908 15.8841 2.99578 15.6926 3.00043 15.5002V5.61523H4.00043V15.5002C3.99565 15.5613 4.00301 15.6228 4.02206 15.681C4.04112 15.7393 4.0715 15.7932 4.11146 15.8396C4.15142 15.8861 4.20017 15.9242 4.25491 15.9518C4.30965 15.9793 4.3693 15.9958 4.43043 16.0002H13.5704C13.6316 15.9958 13.6912 15.9793 13.7459 15.9518C13.8007 15.9242 13.8494 15.8861 13.8894 15.8396C13.9294 15.7932 13.9597 15.7393 13.9788 15.681C13.9978 15.6228 14.0052 15.5613 14.0004 15.5002V5.61523H15.0004V15.5002C15.0051 15.6926 14.9718 15.8841 14.9024 16.0636C14.8331 16.2431 14.729 16.4072 14.5962 16.5465C14.4634 16.6858 14.3045 16.7976 14.1285 16.8754C13.9525 16.9533 13.7628 16.9957 13.5704 17.0002Z" fill="black"/>
    <path d="M15.39 4.5H2.5C2.36739 4.5 2.24021 4.44732 2.14645 4.35355C2.05268 4.25979 2 4.13261 2 4C2 3.86739 2.05268 3.74021 2.14645 3.64645C2.24021 3.55268 2.36739 3.5 2.5 3.5H15.39C15.5226 3.5 15.6498 3.55268 15.7436 3.64645C15.8373 3.74021 15.89 3.86739 15.89 4C15.89 4.13261 15.8373 4.25979 15.7436 4.35355C15.6498 4.44732 15.5226 4.5 15.39 4.5Z" fill="black"/>
    <path d="M10.5 6.5H11.5V14H10.5V6.5Z" fill="black"/>
    <path d="M6.5 6.5H7.5V14H6.5V6.5Z" fill="black"/>
    <path d="M11.5 2.93H10.55V2H7.45V2.93H6.5V2C6.49968 1.74322 6.59815 1.49616 6.775 1.31C6.95186 1.12384 7.19354 1.01284 7.45 1H10.55C10.8065 1.01284 11.0481 1.12384 11.225 1.31C11.4019 1.49616 11.5003 1.74322 11.5 2V2.93Z" fill="black"/>
  </g>
  <defs>
    <clipPath id="clip0_176_1509">
      <rect width="18" height="18" fill="white"/>
    </clipPath>
  </defs>
</svg>
                                    </span>
                                </li>

                                <li class="d-flex flex-row space-between a-i-center">
                                    <span>
                                        John Doe
                                    </span>
                                    <span class="trash-btn">
                                        <svg xmlns="http://www.w3.org/2000/svg" width="18" height="18" viewBox="0 0 18 18" fill="none">
  <g clip-path="url(#clip0_176_1509)">
    <path d="M13.5704 17.0002H4.43043C4.23802 16.9957 4.0484 16.9533 3.87239 16.8754C3.69639 16.7976 3.53744 16.6858 3.40464 16.5465C3.27184 16.4072 3.16779 16.2431 3.09844 16.0636C3.02908 15.8841 2.99578 15.6926 3.00043 15.5002V5.61523H4.00043V15.5002C3.99565 15.5613 4.00301 15.6228 4.02206 15.681C4.04112 15.7393 4.0715 15.7932 4.11146 15.8396C4.15142 15.8861 4.20017 15.9242 4.25491 15.9518C4.30965 15.9793 4.3693 15.9958 4.43043 16.0002H13.5704C13.6316 15.9958 13.6912 15.9793 13.7459 15.9518C13.8007 15.9242 13.8494 15.8861 13.8894 15.8396C13.9294 15.7932 13.9597 15.7393 13.9788 15.681C13.9978 15.6228 14.0052 15.5613 14.0004 15.5002V5.61523H15.0004V15.5002C15.0051 15.6926 14.9718 15.8841 14.9024 16.0636C14.8331 16.2431 14.729 16.4072 14.5962 16.5465C14.4634 16.6858 14.3045 16.7976 14.1285 16.8754C13.9525 16.9533 13.7628 16.9957 13.5704 17.0002Z" fill="black"/>
    <path d="M15.39 4.5H2.5C2.36739 4.5 2.24021 4.44732 2.14645 4.35355C2.05268 4.25979 2 4.13261 2 4C2 3.86739 2.05268 3.74021 2.14645 3.64645C2.24021 3.55268 2.36739 3.5 2.5 3.5H15.39C15.5226 3.5 15.6498 3.55268 15.7436 3.64645C15.8373 3.74021 15.89 3.86739 15.89 4C15.89 4.13261 15.8373 4.25979 15.7436 4.35355C15.6498 4.44732 15.5226 4.5 15.39 4.5Z" fill="black"/>
    <path d="M10.5 6.5H11.5V14H10.5V6.5Z" fill="black"/>
    <path d="M6.5 6.5H7.5V14H6.5V6.5Z" fill="black"/>
    <path d="M11.5 2.93H10.55V2H7.45V2.93H6.5V2C6.49968 1.74322 6.59815 1.49616 6.775 1.31C6.95186 1.12384 7.19354 1.01284 7.45 1H10.55C10.8065 1.01284 11.0481 1.12384 11.225 1.31C11.4019 1.49616 11.5003 1.74322 11.5 2V2.93Z" fill="black"/>
  </g>
  <defs>
    <clipPath id="clip0_176_1509">
      <rect width="18" height="18" fill="white"/>
    </clipPath>
  </defs>
</svg>
                                    </span>
                                </li>

                                <li class="d-flex flex-row space-between a-i-center">
                                    <span>
                                        John Doe
                                    </span>
                                    <span class="trash-btn">
                                        <svg xmlns="http://www.w3.org/2000/svg" width="18" height="18" viewBox="0 0 18 18" fill="none">
  <g clip-path="url(#clip0_176_1509)">
    <path d="M13.5704 17.0002H4.43043C4.23802 16.9957 4.0484 16.9533 3.87239 16.8754C3.69639 16.7976 3.53744 16.6858 3.40464 16.5465C3.27184 16.4072 3.16779 16.2431 3.09844 16.0636C3.02908 15.8841 2.99578 15.6926 3.00043 15.5002V5.61523H4.00043V15.5002C3.99565 15.5613 4.00301 15.6228 4.02206 15.681C4.04112 15.7393 4.0715 15.7932 4.11146 15.8396C4.15142 15.8861 4.20017 15.9242 4.25491 15.9518C4.30965 15.9793 4.3693 15.9958 4.43043 16.0002H13.5704C13.6316 15.9958 13.6912 15.9793 13.7459 15.9518C13.8007 15.9242 13.8494 15.8861 13.8894 15.8396C13.9294 15.7932 13.9597 15.7393 13.9788 15.681C13.9978 15.6228 14.0052 15.5613 14.0004 15.5002V5.61523H15.0004V15.5002C15.0051 15.6926 14.9718 15.8841 14.9024 16.0636C14.8331 16.2431 14.729 16.4072 14.5962 16.5465C14.4634 16.6858 14.3045 16.7976 14.1285 16.8754C13.9525 16.9533 13.7628 16.9957 13.5704 17.0002Z" fill="black"/>
    <path d="M15.39 4.5H2.5C2.36739 4.5 2.24021 4.44732 2.14645 4.35355C2.05268 4.25979 2 4.13261 2 4C2 3.86739 2.05268 3.74021 2.14645 3.64645C2.24021 3.55268 2.36739 3.5 2.5 3.5H15.39C15.5226 3.5 15.6498 3.55268 15.7436 3.64645C15.8373 3.74021 15.89 3.86739 15.89 4C15.89 4.13261 15.8373 4.25979 15.7436 4.35355C15.6498 4.44732 15.5226 4.5 15.39 4.5Z" fill="black"/>
    <path d="M10.5 6.5H11.5V14H10.5V6.5Z" fill="black"/>
    <path d="M6.5 6.5H7.5V14H6.5V6.5Z" fill="black"/>
    <path d="M11.5 2.93H10.55V2H7.45V2.93H6.5V2C6.49968 1.74322 6.59815 1.49616 6.775 1.31C6.95186 1.12384 7.19354 1.01284 7.45 1H10.55C10.8065 1.01284 11.0481 1.12384 11.225 1.31C11.4019 1.49616 11.5003 1.74322 11.5 2V2.93Z" fill="black"/>
  </g>
  <defs>
    <clipPath id="clip0_176_1509">
      <rect width="18" height="18" fill="white"/>
    </clipPath>
  </defs>
</svg>
                                    </span>
                                </li>
                            </ul>
                        </div>
                    </div>
                </div>
                <div class="container-right">
                    <p class="m-b-20">
                        Sélectionnez les contacts qui auront le rôle d’évalué lors de l’épreuve
                    </p>
                    <div class="fields-container">
                        <div class="search">
                            <x-fields.show-search>
                                Évalués*
                            </x-fields.show-search>
                        </div>
                        <div>
                            <p class="medium m-b-16">
                                Evalués séléctionnés
                            </p>
                            <ul class="d-flex flex-c gap-24 ">
                                @for($i = 0; $i<=4; $i++)
                                <li>
                                <div>
                                    <p class="d-flex flex-row space-between a-i-center m-b-8 italic">
                                        John Doe <span class="trash-btn">
                                        <svg xmlns="http://www.w3.org/2000/svg" width="18" height="18" viewBox="0 0 18 18" fill="none">
  <g clip-path="url(#clip0_176_1509)">
    <path d="M13.5704 17.0002H4.43043C4.23802 16.9957 4.0484 16.9533 3.87239 16.8754C3.69639 16.7976 3.53744 16.6858 3.40464 16.5465C3.27184 16.4072 3.16779 16.2431 3.09844 16.0636C3.02908 15.8841 2.99578 15.6926 3.00043 15.5002V5.61523H4.00043V15.5002C3.99565 15.5613 4.00301 15.6228 4.02206 15.681C4.04112 15.7393 4.0715 15.7932 4.11146 15.8396C4.15142 15.8861 4.20017 15.9242 4.25491 15.9518C4.30965 15.9793 4.3693 15.9958 4.43043 16.0002H13.5704C13.6316 15.9958 13.6912 15.9793 13.7459 15.9518C13.8007 15.9242 13.8494 15.8861 13.8894 15.8396C13.9294 15.7932 13.9597 15.7393 13.9788 15.681C13.9978 15.6228 14.0052 15.5613 14.0004 15.5002V5.61523H15.0004V15.5002C15.0051 15.6926 14.9718 15.8841 14.9024 16.0636C14.8331 16.2431 14.729 16.4072 14.5962 16.5465C14.4634 16.6858 14.3045 16.7976 14.1285 16.8754C13.9525 16.9533 13.7628 16.9957 13.5704 17.0002Z" fill="black"/>
    <path d="M15.39 4.5H2.5C2.36739 4.5 2.24021 4.44732 2.14645 4.35355C2.05268 4.25979 2 4.13261 2 4C2 3.86739 2.05268 3.74021 2.14645 3.64645C2.24021 3.55268 2.36739 3.5 2.5 3.5H15.39C15.5226 3.5 15.6498 3.55268 15.7436 3.64645C15.8373 3.74021 15.89 3.86739 15.89 4C15.89 4.13261 15.8373 4.25979 15.7436 4.35355C15.6498 4.44732 15.5226 4.5 15.39 4.5Z" fill="black"/>
    <path d="M10.5 6.5H11.5V14H10.5V6.5Z" fill="black"/>
    <path d="M6.5 6.5H7.5V14H6.5V6.5Z" fill="black"/>
    <path d="M11.5 2.93H10.55V2H7.45V2.93H6.5V2C6.49968 1.74322 6.59815 1.49616 6.775 1.31C6.95186 1.12384 7.19354 1.01284 7.45 1H10.55C10.8065 1.01284 11.0481 1.12384 11.225 1.31C11.4019 1.49616 11.5003 1.74322 11.5 2V2.93Z" fill="black"/>
  </g>
  <defs>
    <clipPath id="clip0_176_1509">
      <rect width="18" height="18" fill="white"/>
    </clipPath>
  </defs>
</svg>
                                    </span>
                                    </p>
                                    <div class="m-l-12">
                                        <p class="m-b-12 medium">
                                            Projets à évaluer*
                                        </p>
                                        <div class="d-flex flex-row gap-12 a-i-center m-b-12">
                                            <div class=" d-flex flex-row gap-8 a-i-center checkbox-projects">
                                                <label for="projects" class="field__label">
                                                    CV
                                                </label>
                                                <input type="checkbox" name="projects" id="projects"
                                                       class="field__input">
                                                @error('projects')
                                                {{$message}}
                                                @enderror
                                            </div>
                                            <span class="trash-btn">
                                        <svg xmlns="http://www.w3.org/2000/svg" width="18" height="18"
                                             viewBox="0 0 18 18" fill="none">
  <g clip-path="url(#clip0_176_1509)">
    <path
        d="M13.5704 17.0002H4.43043C4.23802 16.9957 4.0484 16.9533 3.87239 16.8754C3.69639 16.7976 3.53744 16.6858 3.40464 16.5465C3.27184 16.4072 3.16779 16.2431 3.09844 16.0636C3.02908 15.8841 2.99578 15.6926 3.00043 15.5002V5.61523H4.00043V15.5002C3.99565 15.5613 4.00301 15.6228 4.02206 15.681C4.04112 15.7393 4.0715 15.7932 4.11146 15.8396C4.15142 15.8861 4.20017 15.9242 4.25491 15.9518C4.30965 15.9793 4.3693 15.9958 4.43043 16.0002H13.5704C13.6316 15.9958 13.6912 15.9793 13.7459 15.9518C13.8007 15.9242 13.8494 15.8861 13.8894 15.8396C13.9294 15.7932 13.9597 15.7393 13.9788 15.681C13.9978 15.6228 14.0052 15.5613 14.0004 15.5002V5.61523H15.0004V15.5002C15.0051 15.6926 14.9718 15.8841 14.9024 16.0636C14.8331 16.2431 14.729 16.4072 14.5962 16.5465C14.4634 16.6858 14.3045 16.7976 14.1285 16.8754C13.9525 16.9533 13.7628 16.9957 13.5704 17.0002Z"
        fill="black"/>
    <path
        d="M15.39 4.5H2.5C2.36739 4.5 2.24021 4.44732 2.14645 4.35355C2.05268 4.25979 2 4.13261 2 4C2 3.86739 2.05268 3.74021 2.14645 3.64645C2.24021 3.55268 2.36739 3.5 2.5 3.5H15.39C15.5226 3.5 15.6498 3.55268 15.7436 3.64645C15.8373 3.74021 15.89 3.86739 15.89 4C15.89 4.13261 15.8373 4.25979 15.7436 4.35355C15.6498 4.44732 15.5226 4.5 15.39 4.5Z"
        fill="black"/>
    <path d="M10.5 6.5H11.5V14H10.5V6.5Z" fill="black"/>
    <path d="M6.5 6.5H7.5V14H6.5V6.5Z" fill="black"/>
    <path
        d="M11.5 2.93H10.55V2H7.45V2.93H6.5V2C6.49968 1.74322 6.59815 1.49616 6.775 1.31C6.95186 1.12384 7.19354 1.01284 7.45 1H10.55C10.8065 1.01284 11.0481 1.12384 11.225 1.31C11.4019 1.49616 11.5003 1.74322 11.5 2V2.93Z"
        fill="black"/>
  </g>
  <defs>
    <clipPath id="clip0_176_1509">
      <rect width="18" height="18" fill="white"/>
    </clipPath>
  </defs>
</svg>
                                    </span>
                                        </div>
                                        <div class="d-flex flex-row gap-12 a-i-center m-b-12">
                                            <div class="d-flex flex-row gap-8 a-i-center checkbox-projects">
                                                <label for="projects" class="field__label">
                                                    PF
                                                </label>
                                                <input type="checkbox" name="projects" id="projects"
                                                       class="field__input">
                                                @error('projects')
                                                {{$message}}
                                                @enderror
                                            </div>
                                            <span class="trash-btn">
                                        <svg xmlns="http://www.w3.org/2000/svg" width="18" height="18"
                                             viewBox="0 0 18 18" fill="none">
  <g clip-path="url(#clip0_176_1509)">
    <path
        d="M13.5704 17.0002H4.43043C4.23802 16.9957 4.0484 16.9533 3.87239 16.8754C3.69639 16.7976 3.53744 16.6858 3.40464 16.5465C3.27184 16.4072 3.16779 16.2431 3.09844 16.0636C3.02908 15.8841 2.99578 15.6926 3.00043 15.5002V5.61523H4.00043V15.5002C3.99565 15.5613 4.00301 15.6228 4.02206 15.681C4.04112 15.7393 4.0715 15.7932 4.11146 15.8396C4.15142 15.8861 4.20017 15.9242 4.25491 15.9518C4.30965 15.9793 4.3693 15.9958 4.43043 16.0002H13.5704C13.6316 15.9958 13.6912 15.9793 13.7459 15.9518C13.8007 15.9242 13.8494 15.8861 13.8894 15.8396C13.9294 15.7932 13.9597 15.7393 13.9788 15.681C13.9978 15.6228 14.0052 15.5613 14.0004 15.5002V5.61523H15.0004V15.5002C15.0051 15.6926 14.9718 15.8841 14.9024 16.0636C14.8331 16.2431 14.729 16.4072 14.5962 16.5465C14.4634 16.6858 14.3045 16.7976 14.1285 16.8754C13.9525 16.9533 13.7628 16.9957 13.5704 17.0002Z"
        fill="black"/>
    <path
        d="M15.39 4.5H2.5C2.36739 4.5 2.24021 4.44732 2.14645 4.35355C2.05268 4.25979 2 4.13261 2 4C2 3.86739 2.05268 3.74021 2.14645 3.64645C2.24021 3.55268 2.36739 3.5 2.5 3.5H15.39C15.5226 3.5 15.6498 3.55268 15.7436 3.64645C15.8373 3.74021 15.89 3.86739 15.89 4C15.89 4.13261 15.8373 4.25979 15.7436 4.35355C15.6498 4.44732 15.5226 4.5 15.39 4.5Z"
        fill="black"/>
    <path d="M10.5 6.5H11.5V14H10.5V6.5Z" fill="black"/>
    <path d="M6.5 6.5H7.5V14H6.5V6.5Z" fill="black"/>
    <path
        d="M11.5 2.93H10.55V2H7.45V2.93H6.5V2C6.49968 1.74322 6.59815 1.49616 6.775 1.31C6.95186 1.12384 7.19354 1.01284 7.45 1H10.55C10.8065 1.01284 11.0481 1.12384 11.225 1.31C11.4019 1.49616 11.5003 1.74322 11.5 2V2.93Z"
        fill="black"/>
  </g>
  <defs>
    <clipPath id="clip0_176_1509">
      <rect width="18" height="18" fill="white"/>
    </clipPath>
  </defs>
</svg>
                                    </span>
                                        </div>
                                        <div class="d-flex flex-row  gap-12 a-i-center">
                                            <div class="d-flex flex-row gap-8 a-i-center checkbox-projects">
                                                <label for="projects" class="field__label">
                                                    ART
                                                </label>
                                                <input type="checkbox" name="projects" id="projects"
                                                       class="field__input">
                                                @error('projects')
                                                {{$message}}
                                                @enderror
                                            </div>
                                            <span class="trash-btn">
                                        <svg xmlns="http://www.w3.org/2000/svg" width="18" height="18"
                                             viewBox="0 0 18 18" fill="none">
  <g clip-path="url(#clip0_176_1509)">
    <path
        d="M13.5704 17.0002H4.43043C4.23802 16.9957 4.0484 16.9533 3.87239 16.8754C3.69639 16.7976 3.53744 16.6858 3.40464 16.5465C3.27184 16.4072 3.16779 16.2431 3.09844 16.0636C3.02908 15.8841 2.99578 15.6926 3.00043 15.5002V5.61523H4.00043V15.5002C3.99565 15.5613 4.00301 15.6228 4.02206 15.681C4.04112 15.7393 4.0715 15.7932 4.11146 15.8396C4.15142 15.8861 4.20017 15.9242 4.25491 15.9518C4.30965 15.9793 4.3693 15.9958 4.43043 16.0002H13.5704C13.6316 15.9958 13.6912 15.9793 13.7459 15.9518C13.8007 15.9242 13.8494 15.8861 13.8894 15.8396C13.9294 15.7932 13.9597 15.7393 13.9788 15.681C13.9978 15.6228 14.0052 15.5613 14.0004 15.5002V5.61523H15.0004V15.5002C15.0051 15.6926 14.9718 15.8841 14.9024 16.0636C14.8331 16.2431 14.729 16.4072 14.5962 16.5465C14.4634 16.6858 14.3045 16.7976 14.1285 16.8754C13.9525 16.9533 13.7628 16.9957 13.5704 17.0002Z"
        fill="black"/>
    <path
        d="M15.39 4.5H2.5C2.36739 4.5 2.24021 4.44732 2.14645 4.35355C2.05268 4.25979 2 4.13261 2 4C2 3.86739 2.05268 3.74021 2.14645 3.64645C2.24021 3.55268 2.36739 3.5 2.5 3.5H15.39C15.5226 3.5 15.6498 3.55268 15.7436 3.64645C15.8373 3.74021 15.89 3.86739 15.89 4C15.89 4.13261 15.8373 4.25979 15.7436 4.35355C15.6498 4.44732 15.5226 4.5 15.39 4.5Z"
        fill="black"/>
    <path d="M10.5 6.5H11.5V14H10.5V6.5Z" fill="black"/>
    <path d="M6.5 6.5H7.5V14H6.5V6.5Z" fill="black"/>
    <path
        d="M11.5 2.93H10.55V2H7.45V2.93H6.5V2C6.49968 1.74322 6.59815 1.49616 6.775 1.31C6.95186 1.12384 7.19354 1.01284 7.45 1H10.55C10.8065 1.01284 11.0481 1.12384 11.225 1.31C11.4019 1.49616 11.5003 1.74322 11.5 2V2.93Z"
        fill="black"/>
  </g>
  <defs>
    <clipPath id="clip0_176_1509">
      <rect width="18" height="18" fill="white"/>
    </clipPath>
  </defs>
</svg>
                                    </span>
                                        </div>
                                    </div>
                                </div>
                                </li>
                                @endfor
                            </ul>
                        </div>
                    </div>
                </div>
            </div>

        </fieldset>

        <fieldset class="formfield m-b-32">
                <div class="d-flex flex-row wrap space-between a-i-center">
                    <legend class="h2-title bold">
                        Projets
                    </legend>
                    <p class="caption">
                        * Champs obligatoires
                    </p>
                </div>

                <p class="m-b-20">
                    Sélectionnez les projets qui seront présentés lors de l’épreuve
                </p>

            <div class="m-b-24">
                <div class="two-columns m-b-24">
                    <div class="search">
                        <x-fields.show-search>
                            Projets*
                        </x-fields.show-search>
                    </div>
                    <x-buttons.add-btn-secondary>
                        Créer un nouveau projet
                    </x-buttons.add-btn-secondary>
                </div>
                <div>
                    <p class="medium m-b-16">
                        Projets séléctionnés
                    </p>
                    <ul class="d-flex flex-c gap-24 ">
                        @for($j =0; $j<=4; $j++)
                            <li>
                                <div>
                                    <p class="d-flex flex-row  a-i-center gap-24 m-b-8 italic">
                                        CV<span class="trash-btn">
                                        <svg xmlns="http://www.w3.org/2000/svg" width="18" height="18" viewBox="0 0 18 18" fill="none">
  <g clip-path="url(#clip0_176_1509)">
    <path d="M13.5704 17.0002H4.43043C4.23802 16.9957 4.0484 16.9533 3.87239 16.8754C3.69639 16.7976 3.53744 16.6858 3.40464 16.5465C3.27184 16.4072 3.16779 16.2431 3.09844 16.0636C3.02908 15.8841 2.99578 15.6926 3.00043 15.5002V5.61523H4.00043V15.5002C3.99565 15.5613 4.00301 15.6228 4.02206 15.681C4.04112 15.7393 4.0715 15.7932 4.11146 15.8396C4.15142 15.8861 4.20017 15.9242 4.25491 15.9518C4.30965 15.9793 4.3693 15.9958 4.43043 16.0002H13.5704C13.6316 15.9958 13.6912 15.9793 13.7459 15.9518C13.8007 15.9242 13.8494 15.8861 13.8894 15.8396C13.9294 15.7932 13.9597 15.7393 13.9788 15.681C13.9978 15.6228 14.0052 15.5613 14.0004 15.5002V5.61523H15.0004V15.5002C15.0051 15.6926 14.9718 15.8841 14.9024 16.0636C14.8331 16.2431 14.729 16.4072 14.5962 16.5465C14.4634 16.6858 14.3045 16.7976 14.1285 16.8754C13.9525 16.9533 13.7628 16.9957 13.5704 17.0002Z" fill="black"/>
    <path d="M15.39 4.5H2.5C2.36739 4.5 2.24021 4.44732 2.14645 4.35355C2.05268 4.25979 2 4.13261 2 4C2 3.86739 2.05268 3.74021 2.14645 3.64645C2.24021 3.55268 2.36739 3.5 2.5 3.5H15.39C15.5226 3.5 15.6498 3.55268 15.7436 3.64645C15.8373 3.74021 15.89 3.86739 15.89 4C15.89 4.13261 15.8373 4.25979 15.7436 4.35355C15.6498 4.44732 15.5226 4.5 15.39 4.5Z" fill="black"/>
    <path d="M10.5 6.5H11.5V14H10.5V6.5Z" fill="black"/>
    <path d="M6.5 6.5H7.5V14H6.5V6.5Z" fill="black"/>
    <path d="M11.5 2.93H10.55V2H7.45V2.93H6.5V2C6.49968 1.74322 6.59815 1.49616 6.775 1.31C6.95186 1.12384 7.19354 1.01284 7.45 1H10.55C10.8065 1.01284 11.0481 1.12384 11.225 1.31C11.4019 1.49616 11.5003 1.74322 11.5 2V2.93Z" fill="black"/>
  </g>
  <defs>
    <clipPath id="clip0_176_1509">
      <rect width="18" height="18" fill="white"/>
    </clipPath>
  </defs>
</svg>
                                    </span>
                                    </p>
                                    <div class="two-columns">
                                        <div class="m-l-12">
                                            <p class="m-b-12 medium">
                                                Critères du projet*
                                            </p>
                                            <ul class="d-flex flex-row wrap criteria-list gap-8">
                                                @for($i =0; $i<4; $i++)
                                                    <li>
                                                        <x-fields.text-no-label name="criteria" id="criteria" value="" placeholder="Headingsmap" wire="criteria">
                                                            Critère du projet*
                                                        </x-fields.text-no-label>
                                                    </li>
                                                @endfor
                                            </ul>
                                        </div>
                                        <div>
                                            <div class="text-field">
                                                <label for="percent" class="">
                                                    Pondération
                                                </label>
                                                <div class="d-flex flex-row gap-8 a-i-center">
                                                    <input wire:model.blur="weighting" type="text" name="weighting"
                                                             id="weighting" value=""
                                                             class="field__input small-input" placeholder="16"
                                                             aria-required="true">
                                                    @error('percent')
                                                    <p class="mb-32 error">{{$message}}</p>
                                                    @enderror
                                                    <span>
                                                        %
                                                    </span>
                                                </div>
                                            </div>
                                        </div>
                                    </div>
                                </div>
                            </li>
                        @endfor
                    </ul>
                </div>
            </div>


            <div class="two-columns">
                <p>
                    Ajoutez les critères selon lesquels vous voulez évaluer les projets.
                    Il faut des critères auxquels on peut répondre “oui” ou “non”.
                </p>
                <p>
                    Ajoutez la pondération par projet en %. Vous ne pouvez pas dépasser un total de 100%.
                </p>
            </div>

        </fieldset>

        <x-buttons.submit-btn class="">
            Enregistrer l’épreuve
        </x-buttons.submit-btn>
    </form>
    </div>
</main>

